{
	"FormatVersion": 2,
	"Namespace": "",
	"Children": [
		{
			"Source":
			{
				"Text": "<h1>RichLinks</>\r\n\r\nRichLinks is a lightweight Unreal Engine plugin that enables mouse-events (enter/leave) for <link id=\"inline\">inline links</> inside <link id=\"richtext\">RichTextBlock</> widgets. It's designed for UI developers who want to trigger events or show tooltips when users hover over specific words or tags in rich text.\r\n\r\nTo receive mouse events from link texts (e.g. hover callbacks), your RichTextBlock must use the <link id=\"decorator\">ULinkRichTextDecorator</> and the UUserWidget must implement the <link id=\"interface\">ILinkEventReceiver</> interface."
			},
			"Translation":
			{
				"Text": "<h1>RichLinks</>\r\n\r\nRichLinks ist ein leichtgewichtiges Unreal-Engine-Plugin, das Mausereignisse (Enter/Leave) für <link id=\"inline\">Inline-Links</> in <link id=\"richtext\">RichTextBlock</>-Widgets ermöglicht. Es ist für UI-Entwickler gedacht, die Events auslösen oder Tooltips anzeigen möchten, wenn Benutzer mit dem Mauszeiger über bestimmte Wörter oder Tags in Rich Text fahren.\r\n\r\nUm Mau-Events von Linktexten zu empfangen (z.B. Hover-Callbacks), muss Ihr RichTextBlock den <link id=\"decorator\">ULinkRichTextDecorator</> verwenden und das UUserWidget muss das <link id=\"interface\">ILinkEventReceiver</>-Interface implementieren."
			},
			"Key": "37F1DE5F46643DA392A80A9720D9279C"
		}
	]
}